trunk/HSIM/iServer/IV/xml/SetFilter

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
<Body>
<GetIVUpdatedObjects xmlns="http://schemas.actuate.com/actuate11">
<Operation>
<Target>
<Id>$1</Id>
<Type>Table</Type>
</Target>
<Operator>SetFilter</Operator>
<Oprand>
<Name>columniid</Name>
<Value>$2</Value>
</Oprand>
<Oprand>
<Name>toc</Name>
<Value>false</Value>
</Oprand>
<Oprand>
<Name>page</Name>
<Value>$3</Value>
</Oprand>
<Data>
<Filter>
<Type>Simple</Type>
<Expression>
<Clause>
<ColumnName>
<Name>$4</Name>
</ColumnName>
<FilterOp>gt</FilterOp>
<Operand>$5</Operand>
<Operand></Operand>
</Clause>
</Expression>
</Filter>
</Data>
</Operation>
<IVSessionID>$6</IVSessionID>
</GetIVUpdatedObjects>
</Body>
</Envelope> 
